ruby/saas/hw2/rails-intro/app/controllers/movies_controller.rb

SELECT rating FROM "movies"
SELECT "movies".* FROM "movies" WHERE (rating IN ('G','R','PG-13','PG'))
---
  def index
    @all_ratings = Movie.select(:rating).map(&:rating).uniq

    @has_params = params[:ratings] != nil || params[:sort] != nil
    if @has_params
      session[:saved_params] = {}
      if (params[:sort] != nil)
        session[:saved_params][:sort] = params[:sort]
      end
      if (params[:ratings] != nil)
        session[:saved_params][:ratings] = params[:ratings]
      end

    elsif (session[:saved_params] != nil)
      flash.keep
      redirect_to movies_path + '?' + session[:saved_params].to_query
    end

    @sected_ratings = params[:ratings]
    @movies = Movie.find :all, :conditions => [ "rating IN (?)", params[:ratings] ? params[:ratings].keys : @all_ratings], :order => params[:sort]